pareto-results/sglang_isl1000_osl1000_tp1/concurrency=128/bench.log
/localhome/local-triv/sglang-env/lib/python3.12/site-packages/torch/cuda/__init__.py:61: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='sharegpt', dataset_path='/localhome/local-triv/datasets/fixed_isl1000.json', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=384, sharegpt_output_len=1000, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, request_rate=inf, max_concurrency=128, output_file='/localhome/local-triv/pareto-results/sglang_isl1000_osl1000_tp1/concurrency=128/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=True, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='sharegpt', dataset_path='/localhome/local-triv/datasets/fixed_isl1000.json', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=384, sharegpt_output_len=1000, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, request_rate=inf, max_concurrency=128, output_file='/localhome/local-triv/pareto-results/sglang_isl1000_osl1000_tp1/concurrency=128/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=True, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)

#Input tokens: 384384
#Output tokens: 384000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 384/384 [05:51<00:00,  1.09it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 128       
Successful requests:                     384       
Benchmark duration (s):                  351.89    
Total input tokens:                      384384    
Total generated tokens:                  384000    
Total generated tokens (retokenized):    383993    
Request throughput (req/s):              1.09      
Input token throughput (tok/s):          1092.35   
Output token throughput (tok/s):         1091.26   
Total token throughput (tok/s):          2183.61   
Concurrency:                             127.96    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   117255.36 
Median E2E Latency (ms):                 117746.68 
---------------Time to First Token----------------
Mean TTFT (ms):                          16999.68  
Median TTFT (ms):                        16534.43  
P99 TTFT (ms):                           36292.79  
---------------Inter-Token Latency----------------
Mean ITL (ms):                           100.36    
Median ITL (ms):                         82.13     
P95 ITL (ms):                            137.70    
P99 ITL (ms):                            165.44    
Max ITL (ms):                            35992.41  
==================================================